#include <cstdio>
#include <fcntl.h>
#include <unistd.h>
#include <cstdint>
#include <cstdlib>
#include <pthread.h>
#include <cstring>
#include <cmath>

#include "json.hpp"
#include <fstream>

#include <time.h>

#include <windows.h>

// mingw don't provide a mprotect wrap
#include <memoryapi.h>

// http://undocumented.ntinternals.net/index.html?page=UserMode%2FUndocumented%20Functions%2FNT%20Objects%2FThread%2FNtDelayExecution.html
extern "C"
NTSYSAPI
NTSTATUS
NTAPI
NtDelayExecution(
    BOOLEAN Alertable,
    PLARGE_INTEGER DelayInterval
    );

// http://undocumented.ntinternals.net/index.html?page=UserMode%2FUndocumented%20Functions%2FTime%2FNtSetTimerResolution.html
extern "C"
NTSYSAPI
NTSTATUS
NTAPI
NtQueryTimerResolution(
    PULONG MaximumTime,
    PULONG MinimumTime,
    PULONG CurrentTime
    );


// http://undocumented.ntinternals.net/index.html?page=UserMode%2FUndocumented%20Functions%2FTime%2FNtSetTimerResolution.html
extern "C"
NTSYSAPI
NTSTATUS
NTAPI
NtSetTimerResolution(
    ULONG DesiredTime,
    BOOLEAN SetResolution,
    PULONG ActualTime
    );

static ULONG min_nt_delay_100ns;

#define ENABLE_LOGGING 0

#if ENABLE_LOGGING
FILE *log_file = NULL;
char log_buf[500];
pthread_mutex_t log_mutex;

#define LOG(...) \
{ \
	pthread_mutex_lock(&log_mutex); \
	snprintf(log_buf, sizeof(log_buf), __VA_ARGS__); \
	int _len = strlen(log_buf); \
	if(_len + 1 < sizeof(log_buf)){ \
		log_buf[_len] = '\n'; \
		log_buf[_len + 1] = '\0'; \
	} \
	if(log_file != NULL){ \
		fprintf(log_file, "%s", log_buf); \
		fflush(log_file); \
	}else{ \
		printf("warning: log_file is NULL, logging to stdout \n"); \
		printf("%s", log_buf); \
	} \
	pthread_mutex_unlock(&log_mutex); \
}

#else // ENABLE_LOGGING
#define LOG(...)
#endif //ENABLE_LOGGING

#define VERBOSE 0
#if VERBOSE
	#define LOG_VERBOSE(...) LOG(__VA_ARGS__)
#else // VERBOSE
	#define LOG_VERBOSE(...)
#endif //VERBOSE

// __sync_synchronize() is not enough..?
#define INIT_MEM_FENCE() \
static bool _mem_fence_ready = 0; \
static pthread_mutex_t _mem_fence; \
if(!_mem_fence_ready){ \
	if(pthread_mutex_init(&_mem_fence, NULL)){ \
		LOG("failed to initialize mem fence for %s", __FUNCTION__); \
		exit(1); \
	} \
	_mem_fence_ready = true; \
}

#define MEM_FENCE() \
pthread_mutex_lock(&_mem_fence); \
pthread_mutex_unlock(&_mem_fence);

static pthread_mutex_t config_mutex;
struct config{
	int max_framerate;
	int field_of_view;
	int sprint_field_of_view;
	bool framelimiter_full_busy_loop;
	int framelimiter_busy_loop_buffer_100ns;
};

static uint32_t target_frametime_ns;
static uint32_t target_frametime_100ns;

static float frametime;
static uint64_t frametime_accumulated = 0;
static uint8_t weapon_slot;
static float set_drop_val;

struct config config = {
	.max_framerate = 300,
	.field_of_view = 60,
	.sprint_field_of_view = 80,
	.framelimiter_full_busy_loop = false,
	.framelimiter_busy_loop_buffer_100ns = 15000,
};

static void parse_config(){
	const char *config_file_name = "s4_league_fps_unlock.json";
	std::ifstream config_file(config_file_name);
	if(!config_file.good()){
		LOG("failed opening %s for reading", config_file_name);
		return;
	}

	nlohmann::json parsed_config_file;
	try{
		parsed_config_file = nlohmann::json::parse(config_file);
	}catch(nlohmann::json::exception e){
		LOG("failed parsing %s, %s", config_file_name, e.what());
		return;
	}

	struct config staging_config;
	memcpy(&staging_config, &config, sizeof(struct config));

	try{
		if(!parsed_config_file["max_framerate"].is_number()){
			LOG("failed reading max_framerate from %s", config_file_name)
		}else{
			staging_config.max_framerate = parsed_config_file["max_framerate"];
			if(staging_config.max_framerate > 0){
				LOG_VERBOSE("setting max framerate to %d", staging_config.max_framerate);
			}else{
				LOG_VERBOSE("allowing game to go as fast as it can");
			}
		}
		if(!parsed_config_file["field_of_view"].is_number()){
			LOG("failed reading field_of_view from %s, ", config_file_name)
		}else{
			staging_config.field_of_view = parsed_config_file["field_of_view"];
			LOG_VERBOSE("setting field of view to %d", staging_config.field_of_view);
		}
		if(!parsed_config_file["sprint_field_of_view"].is_number()){
			LOG("failed reading sprint_field_of_view from %s, ", config_file_name)
		}else{
			staging_config.sprint_field_of_view = parsed_config_file["sprint_field_of_view"];
			LOG_VERBOSE("setting sprint field of view to %d", staging_config.sprint_field_of_view);
		}
		if(!parsed_config_file["framelimiter_full_busy_loop"].is_boolean()){
			LOG("failed reading framelimiter_full_busy_loop from %s, ", config_file_name)
		}else{
			staging_config.framelimiter_full_busy_loop = parsed_config_file["framelimiter_full_busy_loop"];
			LOG_VERBOSE("setting framelimiter full busy loop to %s", staging_config.framelimiter_full_busy_loop ? "true" : "false");
		}
		if(!parsed_config_file["framelimiter_busy_loop_buffer_100ns"].is_number()){
			LOG("failed reading framelimiter_busy_loop_buffer_100ns from %s, ", config_file_name)
		}else{
			staging_config.framelimiter_busy_loop_buffer_100ns = parsed_config_file["framelimiter_busy_loop_buffer_100ns"];
			LOG_VERBOSE("setting framelimiter busy loop buffer (100ns) to %s", framelimiter_busy_loop_buffer_100ns);
		}
	}catch(nlohmann::json::exception e){
		LOG("failed reading %s after parsing, %s", config_file_name, e.what());
	}

	if(memcmp(&config, &staging_config, sizeof(struct config)) != 0){
		pthread_mutex_lock(&config_mutex);
		memcpy(&config, &staging_config, sizeof(struct config));
		if(config.max_framerate > 0){
			target_frametime_ns = (1 * 1000 * 1000 * 1000) / config.max_framerate;
			target_frametime_100ns = target_frametime_ns / 100;
		}
		pthread_mutex_unlock(&config_mutex);
	}
}

struct __attribute__ ((packed)) time_context{
	double unknown;
	double last_t;
	double delta_t;
	float delta_t_modifier;
};

struct __attribute__ ((packed)) game_context{
	// 0x48 debug toggle? 1 byte
	// 0x49 fps limiter toggle 1 byte
	// 0x4c unknown 1 byte
	// 0x4a unknown 1 byte
	uint8_t unknown[0x48];
	uint8_t online_verbose_toggle;
	uint8_t fps_limiter_toggle;
};

static struct game_context *(*fetch_game_context)(void) = (struct game_context *(*)(void)) 0x004ad790;
static void (__attribute__((thiscall)) *update_time_delta)(struct time_context *ctx) = (void (__attribute__((thiscall)) *)(struct time_context *ctx)) 0x00ff7f30;

// contains actor state
struct ctx_01642f30{
	uint8_t unknown[0xb0];
	uint8_t actor_state;
	uint8_t unknown_2[0x3];
	uint32_t actor_substate_1;
	uint32_t actor_substate_2;
};
static struct ctx_01642f30 *(*fetch_ctx_01642f30)(void) = (struct ctx_01642f30 *(*)(void)) 0x004ae0a0;

// hook random spread calculation
struct ctx_calculate_random_spread{
	uint8_t unknown[0x12c];
	uint32_t shooting; // 0x12c
	uint8_t unknown_2[0x18];
	uint32_t spread_type; // 0x148
	uint8_t unknown_3[0x24];
	uint32_t inner_spread_recovery; // 0x170
	uint32_t inner_spread_recovery_flipped; // 0x174
	uint32_t inner_spread_recovery_xor_key; // 0x178
	uint8_t unknown_4[0xc];
	uint32_t inner_verdict; // 0x188
	uint32_t inner_verdict_flipped; // 0x18c
	uint32_t inner_verdict_xor_key; // 0x190
	uint8_t unknown_5[0x18];
	uint32_t outer_spread_recovery; // 0x1ac
	uint32_t outer_spread_recovery_flipped; // 0x1b0
	uint32_t outer_spread_recovery_xor_key; // 0x1b4
	uint8_t unknown_6[0xc];
	uint32_t outer_verdict; // 0x1c4
	uint32_t outer_verdict_flipped; // 0x1c8
	uint32_t outer_verdict_xor_key; // 0x1cc
};

static void (__attribute__((thiscall)) *orig_calculate_weapon_spread)(struct ctx_calculate_random_spread *, float, uint32_t);
void __attribute__((thiscall)) patched_calculate_weapon_spread(struct ctx_calculate_random_spread *ctx, float param_1, uint32_t param_2){
	uint32_t orig_inner_spread_recovery = ctx->inner_spread_recovery ^ ctx->inner_spread_recovery_xor_key;
	uint32_t orig_outer_spread_recovery = ctx->outer_spread_recovery ^ ctx->outer_spread_recovery_xor_key;

	if(ctx->spread_type == 2){
		LOG_VERBOSE("%s: random spread, ctx 0x%08x", __FUNCTION__, ctx);
		const double orig_fixed_frametime = 1.66666666666666678509045596002E1;
		float frametime_scale = frametime / orig_fixed_frametime;

		float new_inner_spread_recovery_f = (*(float *)&orig_inner_spread_recovery) * frametime_scale;
		float new_outer_spread_recovery_f = (*(float *)&orig_outer_spread_recovery) * frametime_scale;

